# Лабораторна робота №1. Основи Python
# Варіант: 2
# ПІБ: Береговий Максим Віталійович

# Тут має бути Ваш код
# Введення кількості оренів користувачем
orens = float(input("Введіть кількість оренів для обміну: "))

# Перевірка, чи введена сума більша за нуль
if orens >= 0:
    # Задаємо курси валют
    # 1 орен = 1 крона
    # 1 флорен = 3 крони

    # Конвертація
    crowns = orens * 1
    florens = orens / 3

    # Виведення результатів з округленням до 2 знаків
    print("Ваші заощадження в інших валютах:")
    print("Крони:", round(crowns, 2))
    print("Флорени:", round(florens, 2))
else:
    # Повідомлення, якщо введено від'ємне число
    print("Помилка: кількість оренів не може бути від'ємною.")
